.emacs.d/Desktop.org
#+title AVA Emacs desktop settings
#+PROPERTY: header-args:emacs-lisp :tangle ./desktop.el

* EMACS Desktop configs
** Basic stuffs

#+begin_src emacs-lisp
  (server-start)
  (defun ava/run-in-background (command)
  (let ((command-parts (split-string command "[ ]+")))
      (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

#+end_src

** Functions definitions

#+begin_src emacs-lisp

  (defun change-theme()
    "First disable all themes and then chose a theme and font"
    (shell-command "nitrogen --restore")
    (shell-command "start_picom.sh \"emacs\"")
    (ava/update-transparency)
    (disable-all-themes)
    (load-theme (get-theme) t)
    (set-frame-parameter (selected-frame) 'alpha ava/transparency-level)
    (add-to-list 'default-frame-alist ava/transparency-level-list)
    (set-face-attribute 'default nil :font (get-font) :height ava/default-font-size))

  (defun ava/exwm-rename-buffer ()
    (interactive)
    (exwm-workspace-rename-buffer
     (concat exwm-class-name ":"
             (if (<= (length exwm-title) 50) exwm-title
               (concat (substring exwm-title 0 49) "...")))))

#+end_src

** The init Hook

#+begin_src emacs-lisp

  ;; Put here the inital programs to run
  (defun ava/exwm-init-hook ()
    ;; (start-process-shell-command "set_wallpaper" nil "wallpaper_changer.sh")
    ;; (start-process-shell-command "set_theme" nil "theme_select.sh -emacs")
    (ava/run-in-background "nitrogen --restore")
    (with-eval-after-load 'doom-themes (load-theme (get-theme) t))
    )

  (defun ava/exwm-update-class ()
    (exwm-workspace-rename-buffer exwm-class-name))

  (defun ava/exwm-update-title ()
    (pcase exwm-class-name
      ("Firefox" (exwm-workspace-rename-buffer (format "Firefox: %s" exwm-title)))))

  ;; (defun ava/configure-window-by-class ()
  ;;   (interactive)
  ;;   (pcase exwm-class-name
  ;;     ("Firefox" (exwm-workspace-move-window 2))
  ;;     ("Sol" (exwm-workspace-move-window 3))
  ;;     ("mpv" (exwm-floating-toggle-floating)
  ;;      (exwm-layout-toggle-mode-line))))

#+end_src

** Use Package for exwm

#+begin_src emacs-lisp

  (use-package exwm
    :config
    ;; Set the default number of workspaces
    (setq exwm-workspace-number 10)

    ;; Total focus
    (setq exwm-workspace-minibuffer-position 'top)

    ;; Char mode by default
    (setq exwm-manage-configurations '((t char-mode t)))
    ;; These keys should always pass through to Emacs
    (setq exwm-input-prefix-keys
          '(?\C-x
            ?\M-x
            ?\s-d
            f5
            ))


    ;; When window "class" updates, use it to set the buffer name
    (add-hook 'exwm-update-class-hook #'ava/exwm-update-class)

    ;; When window title updates, use it to set the buffer name
    ;; (add-hook 'exwm-update-title-hook #'ava/exwm-update-title)

    ;; Add these hooks in a suitable place (e.g., as done in exwm-config-default)
    (add-hook 'exwm-update-class-hook 'ava/exwm-rename-buffer)
    (add-hook 'exwm-update-title-hook 'ava/exwm-rename-buffer)

    ;; Configure windows as they're created
    ;; (add-hook 'exwm-manage-finish-hook #'ava/configure-window-by-class)


    ;; When EXWM starts up, do some extra confifuration
    (add-hook 'exwm-init-hook #'ava/exwm-init-hook)

    (require 'exwm-randr)
    (exwm-randr-enable)
    ;; Configure the kmap and change caps for control
    (start-process-shell-command "kmap" nil "setkmap")

    ;; Turnoff the sleep timer of the monitor
    (start-process-shell-command "nosleep" nil "saver.sh &")
    ;; Give three monitors to the second screen. It can be changed on time.
    (setq exwm-randr-workspace-output-plist '(0 "eDP1" 9 "eDP1" 8 "eDP1"))

    ;; Ctrl+Q will enable the next key to be sent directly
    (define-key exwm-mode-map [?\C-q] 'exwm-input-send-next-key)

    ;; Set up global key bindings.  These always work, no matter the input state!
    (setq exwm-input-global-keys
          `(
            ([f5] . persp-counsel-switch-buffer)
            ([?\s-r] . exwm-reset)
            ([?\s-d] . counsel-linux-app)

            ;; Launch applications via shell command
            ([?\s-$] . (lambda (command)
                         (interactive (list (read-shell-command "$ ")))
                         (start-process-shell-command command nil command)))

            ;; Move Window keys
            ([?\s-h] . windmove-left)
            ([?\s-l] . windmove-right)
            ([?\s-k] . windmove-up)
            ([?\s-j] . windmove-down)
            ;; Movement keys
            ([?\s-H] . windower-swap-left)
            ([?\s-L] . windower-swap-right)
            ([?\s-K] . windower-swap-above)
            ([?\s-J] . windower-swap-below)

            ([?\s-%] . split-window-right)
            ([?\s-\"] . split-window-below)
            ([?\s-Q] . kill-buffer)
            ([?\s-q] . delete-window)
            ([?\s-i] . exwm-input-toggle-keyboard)
            ;; ([?\s-v] . exwm-workspace-delete)
            ([?\s-v] . hide-mode-line-mode)
            ([?\s-a] . exwm-workspace-add)
            ([?\s-w] . exwm-workspace-switch)
            ,@(mapcar (lambda (i)
                        `(,(kbd (format "s-%d" i)) .
                          (lambda ()
                            (interactive)
                            (exwm-workspace-switch-create ,i))))
                      (number-sequence 0 9))))
    (exwm-enable)

   )

#+end_src


* Desktop enviroment
Configure the special functions like sound, brightes etc...
This guy is not good on programming, so it is hard to change the keys. So this thing is necessary to change the lockscreen.

#+begin_src emacs-lisp

  (use-package desktop-environment
    :after exwm
    :config
    (progn
    (unbind-key "s-l" desktop-environment-mode-map)
    (bind-key "s-x" 'desktop-environment-lock-screen)
    (desktop-environment-mode))
    :custom
    (desktop-environment-brightness-small-increment "2%+")
    (desktop-environment-brightness-small-decrement "2%-")
    (desktop-environment-brightness-normal-increment "5%+")
    (desktop-environment-brightness-normal-decrement "5%-")
    (exwm-input--update-global-prefix-keys)
    )

#+end_src


* Testing packages
This session is packages that were tested and the comments with the results of the tests

** Dmenu
It is good to replace counsel, it seems not to have all the functionalities from dmenu (At list I couldnt figure it out) so it will not be used because it don't worth it.

#+begin_src shell

  ;; (use-package dmenu)

#+end_src


* Non Lisp files
** The shell server

The idea is to start a server and then start a session with the client. It will in theory make the process a lot faster.
*NOTE*: It didn't work. But I will mandain the config here just because it is usefull.

#+begin_src sh :tangle /home/alexvanaxe/bin/emacs-server.sh :tangle-mode (identity #o700)

  #! /bin/bash
  iswmmode="$1"

  if [ -z "${iswmmode}" ]; then
    emacs --daemon -bg "#000000" -fg "#ffffff" -mm --debug-init -l $HOME/.emacs.d/desktop.el
  else
    emacs --daemon -bg "#000000" -fg "#ffffff" -mm --debug-init
  fi
  #exec dbus-launch --exit-with-session emacsclient -c

#+end_src


Start the client
#+begin_src sh :tangle /home/alexvanaxe/bin/wms/emacs-client.sh :tangle-mode (identity #o700)
#! /bin/bash

export WM_RUNNING="emacs"
$HOME/.config/i3/monitor/saver.sh &
display_manager.sh -o "HDMI1 eDP1"
display_manager.sh -p "HDMI1"
start_picom.sh "emacs"

exec dbus-launch emacsclient -c

#+end_src

** Start script.

Start the client.

#+begin_src sh :tangle /home/alexvanaxe/bin/wms/start-emacs.sh :tangle-mode (identity #o700)
#! /bin/bash

export WM_RUNNING="emacs"
$HOME/.config/i3/monitor/saver.sh &
display_manager.sh -o "HDMI1 eDP1"
display_manager.sh -p "HDMI1"
start_picom.sh "emacs"

#exec dbus-launch --exit-with-session emacs -bg "#000000" -fg "#ffffff" -mm --debug-init -l $HOME/.emacs.d/desktop.el
exec dbus-launch --exit-with-session emacs -bg "#000000" -fg "#ffffff" -mm --debug-init -l $HOME/.emacs.d/desktop.el

#+end_src
